micropython/micropython/stmhal/cmsis/stm32f469xx.h
#define DSI_LCOLCR_LPE                 0x00000100U               /*!< Loosly Packet Enable */

/*******************  Bit definition for DSI_LPCR register  ***************/
#define DSI_LPCR_DEP                   0x00000001U               /*!< Data Enable Polarity */
#define DSI_LPCR_VSP                   0x00000002U               /*!< VSYNC Polarity */
#define DSI_LPCR_HSP                   0x00000004U               /*!< HSYNC Polarity */

/*******************  Bit definition for DSI_LPMCR register  **************/
#define DSI_LPMCR_VLPSIZE              0x000000FFU               /*!< VACT Largest Packet Size */
#define DSI_LPMCR_VLPSIZE0             0x00000001U
#define DSI_LPMCR_VLPSIZE1             0x00000002U
#define DSI_LPMCR_VLPSIZE2             0x00000004U
#define DSI_LPMCR_VLPSIZE3             0x00000008U
#define DSI_LPMCR_VLPSIZE4             0x00000010U
#define DSI_LPMCR_VLPSIZE5             0x00000020U
#define DSI_LPMCR_VLPSIZE6             0x00000040U
#define DSI_LPMCR_VLPSIZE7             0x00000080U

#define DSI_LPMCR_LPSIZE               0x00FF0000U               /*!< Largest Packet Size */
#define DSI_LPMCR_LPSIZE0              0x00010000U
#define DSI_LPMCR_LPSIZE1              0x00020000U
#define DSI_LPMCR_LPSIZE2              0x00040000U
#define DSI_LPMCR_LPSIZE3              0x00080000U
#define DSI_LPMCR_LPSIZE4              0x00100000U
#define DSI_LPMCR_LPSIZE5              0x00200000U
#define DSI_LPMCR_LPSIZE6              0x00400000U
#define DSI_LPMCR_LPSIZE7              0x00800000U

/*******************  Bit definition for DSI_PCR register  ****************/
#define DSI_PCR_ETTXE                  0x00000001U               /*!< EoTp Transmission Enable */
#define DSI_PCR_ETRXE                  0x00000002U               /*!< EoTp Reception Enable */
#define DSI_PCR_BTAE                   0x00000004U               /*!< Bus Turn Around Enable */
#define DSI_PCR_ECCRXE                 0x00000008U               /*!< ECC Reception Enable */
#define DSI_PCR_CRCRXE                 0x00000010U               /*!< CRC Reception Enable */

/*******************  Bit definition for DSI_GVCIDR register  *************/
#define DSI_GVCIDR_VCID                0x00000003U               /*!< Virtual Channel ID */
#define DSI_GVCIDR_VCID0               0x00000001U
#define DSI_GVCIDR_VCID1               0x00000002U

/*******************  Bit definition for DSI_MCR register  ****************/
#define DSI_MCR_CMDM                   0x00000001U               /*!< Command Mode */

/*******************  Bit definition for DSI_VMCR register  ***************/
#define DSI_VMCR_VMT                   0x00000003U               /*!< Video Mode Type */
#define DSI_VMCR_VMT0                  0x00000001U
#define DSI_VMCR_VMT1                  0x00000002U

#define DSI_VMCR_LPVSAE                0x00000100U               /*!< Low-Power Vertical Sync Active Enable */
#define DSI_VMCR_LPVBPE                0x00000200U               /*!< Low-power Vertical Back-Porch Enable */
#define DSI_VMCR_LPVFPE                0x00000400U               /*!< Low-power Vertical Front-porch Enable */
#define DSI_VMCR_LPVAE                 0x00000800U               /*!< Low-Power Vertical Active Enable */
#define DSI_VMCR_LPHBPE                0x00001000U               /*!< Low-Power Horizontal Back-Porch Enable */
#define DSI_VMCR_LPHFPE                0x00002000U               /*!< Low-Power Horizontal Front-Porch Enable */
#define DSI_VMCR_FBTAAE                0x00004000U               /*!< Frame Bus-Turn-Around Acknowledge Enable */
#define DSI_VMCR_LPCE                  0x00008000U               /*!< Low-Power Command Enable */
#define DSI_VMCR_PGE                   0x00010000U               /*!< Pattern Generator Enable */
#define DSI_VMCR_PGM                   0x00100000U               /*!< Pattern Generator Mode */
#define DSI_VMCR_PGO                   0x01000000U               /*!< Pattern Generator Orientation */

/*******************  Bit definition for DSI_VPCR register  ***************/
#define DSI_VPCR_VPSIZE                0x00003FFFU               /*!< Video Packet Size */
#define DSI_VPCR_VPSIZE0               0x00000001U
#define DSI_VPCR_VPSIZE1               0x00000002U
#define DSI_VPCR_VPSIZE2               0x00000004U
#define DSI_VPCR_VPSIZE3               0x00000008U
#define DSI_VPCR_VPSIZE4               0x00000010U
#define DSI_VPCR_VPSIZE5               0x00000020U
#define DSI_VPCR_VPSIZE6               0x00000040U
#define DSI_VPCR_VPSIZE7               0x00000080U
#define DSI_VPCR_VPSIZE8               0x00000100U
#define DSI_VPCR_VPSIZE9               0x00000200U
#define DSI_VPCR_VPSIZE10              0x00000400U
#define DSI_VPCR_VPSIZE11              0x00000800U
#define DSI_VPCR_VPSIZE12              0x00001000U
#define DSI_VPCR_VPSIZE13              0x00002000U

/*******************  Bit definition for DSI_VCCR register  ***************/
#define DSI_VCCR_NUMC                  0x00001FFFU               /*!< Number of Chunks */
#define DSI_VCCR_NUMC0                 0x00000001U
#define DSI_VCCR_NUMC1                 0x00000002U
#define DSI_VCCR_NUMC2                 0x00000004U
#define DSI_VCCR_NUMC3                 0x00000008U
#define DSI_VCCR_NUMC4                 0x00000010U
#define DSI_VCCR_NUMC5                 0x00000020U
#define DSI_VCCR_NUMC6                 0x00000040U
#define DSI_VCCR_NUMC7                 0x00000080U
#define DSI_VCCR_NUMC8                 0x00000100U
#define DSI_VCCR_NUMC9                 0x00000200U
#define DSI_VCCR_NUMC10                0x00000400U
#define DSI_VCCR_NUMC11                0x00000800U
#define DSI_VCCR_NUMC12                0x00001000U

/*******************  Bit definition for DSI_VNPCR register  **************/
#define DSI_VNPCR_NPSIZE               0x00001FFFU               /*!< Null Packet Size */
#define DSI_VNPCR_NPSIZE0              0x00000001U
#define DSI_VNPCR_NPSIZE1              0x00000002U
#define DSI_VNPCR_NPSIZE2              0x00000004U
#define DSI_VNPCR_NPSIZE3              0x00000008U
#define DSI_VNPCR_NPSIZE4              0x00000010U
#define DSI_VNPCR_NPSIZE5              0x00000020U
#define DSI_VNPCR_NPSIZE6              0x00000040U
#define DSI_VNPCR_NPSIZE7              0x00000080U
#define DSI_VNPCR_NPSIZE8              0x00000100U
#define DSI_VNPCR_NPSIZE9              0x00000200U
#define DSI_VNPCR_NPSIZE10             0x00000400U
#define DSI_VNPCR_NPSIZE11             0x00000800U
#define DSI_VNPCR_NPSIZE12             0x00001000U

/*******************  Bit definition for DSI_VHSACR register  *************/
#define DSI_VHSACR_HSA                 0x00000FFFU               /*!< Horizontal Synchronism Active duration */
#define DSI_VHSACR_HSA0                0x00000001U
#define DSI_VHSACR_HSA1                0x00000002U
#define DSI_VHSACR_HSA2                0x00000004U
#define DSI_VHSACR_HSA3                0x00000008U
#define DSI_VHSACR_HSA4                0x00000010U
#define DSI_VHSACR_HSA5                0x00000020U
#define DSI_VHSACR_HSA6                0x00000040U
#define DSI_VHSACR_HSA7                0x00000080U
#define DSI_VHSACR_HSA8                0x00000100U
#define DSI_VHSACR_HSA9                0x00000200U
#define DSI_VHSACR_HSA10               0x00000400U
#define DSI_VHSACR_HSA11               0x00000800U

/*******************  Bit definition for DSI_VHBPCR register  *************/
#define DSI_VHBPCR_HBP                 0x00000FFFU               /*!< Horizontal Back-Porch duration */
#define DSI_VHBPCR_HBP0                0x00000001U
#define DSI_VHBPCR_HBP1                0x00000002U
#define DSI_VHBPCR_HBP2                0x00000004U
#define DSI_VHBPCR_HBP3                0x00000008U
#define DSI_VHBPCR_HBP4                0x00000010U
#define DSI_VHBPCR_HBP5                0x00000020U
#define DSI_VHBPCR_HBP6                0x00000040U
#define DSI_VHBPCR_HBP7                0x00000080U
#define DSI_VHBPCR_HBP8                0x00000100U
#define DSI_VHBPCR_HBP9                0x00000200U
#define DSI_VHBPCR_HBP10               0x00000400U
#define DSI_VHBPCR_HBP11               0x00000800U

