micropython/micropython/stmhal/cmsis/stm32f469xx.h
/*******************  Bit definition for DSI_VLCR register  ***************/
#define DSI_VLCR_HLINE                 0x00007FFFU               /*!< Horizontal Line duration */
#define DSI_VLCR_HLINE0                0x00000001U
#define DSI_VLCR_HLINE1                0x00000002U
#define DSI_VLCR_HLINE2                0x00000004U
#define DSI_VLCR_HLINE3                0x00000008U
#define DSI_VLCR_HLINE4                0x00000010U
#define DSI_VLCR_HLINE5                0x00000020U
#define DSI_VLCR_HLINE6                0x00000040U
#define DSI_VLCR_HLINE7                0x00000080U
#define DSI_VLCR_HLINE8                0x00000100U
#define DSI_VLCR_HLINE9                0x00000200U
#define DSI_VLCR_HLINE10               0x00000400U
#define DSI_VLCR_HLINE11               0x00000800U
#define DSI_VLCR_HLINE12               0x00001000U
#define DSI_VLCR_HLINE13               0x00002000U
#define DSI_VLCR_HLINE14               0x00004000U

/*******************  Bit definition for DSI_VVSACR register  *************/
#define DSI_VVSACR_VSA                 0x000003FFU               /*!< Vertical Synchronism Active duration */
#define DSI_VVSACR_VSA0                0x00000001U
#define DSI_VVSACR_VSA1                0x00000002U
#define DSI_VVSACR_VSA2                0x00000004U
#define DSI_VVSACR_VSA3                0x00000008U
#define DSI_VVSACR_VSA4                0x00000010U
#define DSI_VVSACR_VSA5                0x00000020U
#define DSI_VVSACR_VSA6                0x00000040U
#define DSI_VVSACR_VSA7                0x00000080U
#define DSI_VVSACR_VSA8                0x00000100U
#define DSI_VVSACR_VSA9                0x00000200U

/*******************  Bit definition for DSI_VVBPCR register  *************/
#define DSI_VVBPCR_VBP                 0x000003FFU               /*!< Vertical Back-Porch duration */
#define DSI_VVBPCR_VBP0                0x00000001U
#define DSI_VVBPCR_VBP1                0x00000002U
#define DSI_VVBPCR_VBP2                0x00000004U
#define DSI_VVBPCR_VBP3                0x00000008U
#define DSI_VVBPCR_VBP4                0x00000010U
#define DSI_VVBPCR_VBP5                0x00000020U
#define DSI_VVBPCR_VBP6                0x00000040U
#define DSI_VVBPCR_VBP7                0x00000080U
#define DSI_VVBPCR_VBP8                0x00000100U
#define DSI_VVBPCR_VBP9                0x00000200U

/*******************  Bit definition for DSI_VVFPCR register  *************/
#define DSI_VVFPCR_VFP                 0x000003FFU               /*!< Vertical Front-Porch duration */
#define DSI_VVFPCR_VFP0                0x00000001U
#define DSI_VVFPCR_VFP1                0x00000002U
#define DSI_VVFPCR_VFP2                0x00000004U
#define DSI_VVFPCR_VFP3                0x00000008U
#define DSI_VVFPCR_VFP4                0x00000010U
#define DSI_VVFPCR_VFP5                0x00000020U
#define DSI_VVFPCR_VFP6                0x00000040U
#define DSI_VVFPCR_VFP7                0x00000080U
#define DSI_VVFPCR_VFP8                0x00000100U
#define DSI_VVFPCR_VFP9                0x00000200U

/*******************  Bit definition for DSI_VVACR register  **************/
#define DSI_VVACR_VA                   0x00003FFFU               /*!< Vertical Active duration */
#define DSI_VVACR_VA0                  0x00000001U
#define DSI_VVACR_VA1                  0x00000002U
#define DSI_VVACR_VA2                  0x00000004U
#define DSI_VVACR_VA3                  0x00000008U
#define DSI_VVACR_VA4                  0x00000010U
#define DSI_VVACR_VA5                  0x00000020U
#define DSI_VVACR_VA6                  0x00000040U
#define DSI_VVACR_VA7                  0x00000080U
#define DSI_VVACR_VA8                  0x00000100U
#define DSI_VVACR_VA9                  0x00000200U
#define DSI_VVACR_VA10                 0x00000400U
#define DSI_VVACR_VA11                 0x00000800U
#define DSI_VVACR_VA12                 0x00001000U
#define DSI_VVACR_VA13                 0x00002000U

/*******************  Bit definition for DSI_LCCR register  ***************/
#define DSI_LCCR_CMDSIZE               0x0000FFFFU               /*!< Command Size */
#define DSI_LCCR_CMDSIZE0              0x00000001U
#define DSI_LCCR_CMDSIZE1              0x00000002U
#define DSI_LCCR_CMDSIZE2              0x00000004U
#define DSI_LCCR_CMDSIZE3              0x00000008U
#define DSI_LCCR_CMDSIZE4              0x00000010U
#define DSI_LCCR_CMDSIZE5              0x00000020U
#define DSI_LCCR_CMDSIZE6              0x00000040U
#define DSI_LCCR_CMDSIZE7              0x00000080U
#define DSI_LCCR_CMDSIZE8              0x00000100U
#define DSI_LCCR_CMDSIZE9              0x00000200U
#define DSI_LCCR_CMDSIZE10             0x00000400U
#define DSI_LCCR_CMDSIZE11             0x00000800U
#define DSI_LCCR_CMDSIZE12             0x00001000U
#define DSI_LCCR_CMDSIZE13             0x00002000U
#define DSI_LCCR_CMDSIZE14             0x00004000U
#define DSI_LCCR_CMDSIZE15             0x00008000U

/*******************  Bit definition for DSI_CMCR register  ***************/
#define DSI_CMCR_TEARE                 0x00000001U               /*!< Tearing Effect Acknowledge Request Enable */
#define DSI_CMCR_ARE                   0x00000002U               /*!< Acknowledge Request Enable */
#define DSI_CMCR_GSW0TX                0x00000100U               /*!< Generic Short Write Zero parameters Transmission */
#define DSI_CMCR_GSW1TX                0x00000200U               /*!< Generic Short Write One parameters Transmission */
#define DSI_CMCR_GSW2TX                0x00000400U               /*!< Generic Short Write Two parameters Transmission */
#define DSI_CMCR_GSR0TX                0x00000800U               /*!< Generic Short Read Zero parameters Transmission */
#define DSI_CMCR_GSR1TX                0x00001000U               /*!< Generic Short Read One parameters Transmission */
#define DSI_CMCR_GSR2TX                0x00002000U               /*!< Generic Short Read Two parameters Transmission */
#define DSI_CMCR_GLWTX                 0x00004000U               /*!< Generic Long Write Transmission */
#define DSI_CMCR_DSW0TX                0x00010000U               /*!< DCS Short Write Zero parameter Transmission */
#define DSI_CMCR_DSW1TX                0x00020000U               /*!< DCS Short Read One parameter Transmission */
#define DSI_CMCR_DSR0TX                0x00040000U               /*!< DCS Short Read Zero parameter Transmission */
#define DSI_CMCR_DLWTX                 0x00080000U               /*!< DCS Long Write Transmission */
#define DSI_CMCR_MRDPS                 0x01000000U               /*!< Maximum Read Packet Size */

/*******************  Bit definition for DSI_GHCR register  ***************/
#define DSI_GHCR_DT                    0x0000003FU               /*!< Type */
#define DSI_GHCR_DT0                   0x00000001U
#define DSI_GHCR_DT1                   0x00000002U
#define DSI_GHCR_DT2                   0x00000004U
#define DSI_GHCR_DT3                   0x00000008U
#define DSI_GHCR_DT4                   0x00000010U
#define DSI_GHCR_DT5                   0x00000020U

#define DSI_GHCR_VCID                  0x000000C0U               /*!< Channel */
#define DSI_GHCR_VCID0                 0x00000040U
#define DSI_GHCR_VCID1                 0x00000080U

#define DSI_GHCR_WCLSB                 0x0000FF00U               /*!< WordCount LSB */
#define DSI_GHCR_WCLSB0                0x00000100U
#define DSI_GHCR_WCLSB1                0x00000200U
#define DSI_GHCR_WCLSB2                0x00000400U
#define DSI_GHCR_WCLSB3                0x00000800U
#define DSI_GHCR_WCLSB4                0x00001000U
#define DSI_GHCR_WCLSB5                0x00002000U
#define DSI_GHCR_WCLSB6                0x00004000U
#define DSI_GHCR_WCLSB7                0x00008000U

