micropython/micropython/stmhal/cmsis/stm32f469xx.h
/*******************  Bit definition for DSI_PCTLR register  **************/
#define DSI_PCTLR_DEN                  0x00000002U               /*!< Digital Enable */
#define DSI_PCTLR_CKE                  0x00000004U               /*!< Clock Enable */

/*******************  Bit definition for DSI_PCONFR register  *************/
#define DSI_PCONFR_NL                  0x00000003U               /*!< Number of Lanes */
#define DSI_PCONFR_NL0                 0x00000001U
#define DSI_PCONFR_NL1                 0x00000002U

#define DSI_PCONFR_SW_TIME             0x0000FF00U               /*!< Stop Wait Time */
#define DSI_PCONFR_SW_TIME0            0x00000100U
#define DSI_PCONFR_SW_TIME1            0x00000200U
#define DSI_PCONFR_SW_TIME2            0x00000400U
#define DSI_PCONFR_SW_TIME3            0x00000800U
#define DSI_PCONFR_SW_TIME4            0x00001000U
#define DSI_PCONFR_SW_TIME5            0x00002000U
#define DSI_PCONFR_SW_TIME6            0x00004000U
#define DSI_PCONFR_SW_TIME7            0x00008000U

/*******************  Bit definition for DSI_PUCR register  ***************/
#define DSI_PUCR_URCL                  0x00000001U               /*!< ULPS Request on Clock Lane */
#define DSI_PUCR_UECL                  0x00000002U               /*!< ULPS Exit on Clock Lane */
#define DSI_PUCR_URDL                  0x00000004U               /*!< ULPS Request on Data Lane */
#define DSI_PUCR_UEDL                  0x00000008U               /*!< ULPS Exit on Data Lane */

/*******************  Bit definition for DSI_PTTCR register  **************/
#define DSI_PTTCR_TX_TRIG              0x0000000FU               /*!< Transmission Trigger */
#define DSI_PTTCR_TX_TRIG0             0x00000001U
#define DSI_PTTCR_TX_TRIG1             0x00000002U
#define DSI_PTTCR_TX_TRIG2             0x00000004U
#define DSI_PTTCR_TX_TRIG3             0x00000008U

/*******************  Bit definition for DSI_PSR register  ****************/
#define DSI_PSR_PD                     0x00000002U               /*!< PHY Direction */
#define DSI_PSR_PSSC                   0x00000004U               /*!< PHY Stop State Clock lane */
#define DSI_PSR_UANC                   0x00000008U               /*!< ULPS Active Not Clock lane */
#define DSI_PSR_PSS0                   0x00000010U               /*!< PHY Stop State lane 0 */
#define DSI_PSR_UAN0                   0x00000020U               /*!< ULPS Active Not lane 0 */
#define DSI_PSR_RUE0                   0x00000040U               /*!< RX ULPS Escape lane 0 */
#define DSI_PSR_PSS1                   0x00000080U               /*!< PHY Stop State lane 1 */
#define DSI_PSR_UAN1                   0x00000100U               /*!< ULPS Active Not lane 1 */

/*******************  Bit definition for DSI_ISR0 register  ***************/
#define DSI_ISR0_AE0                   0x00000001U               /*!< Acknowledge Error 0 */
#define DSI_ISR0_AE1                   0x00000002U               /*!< Acknowledge Error 1 */
#define DSI_ISR0_AE2                   0x00000004U               /*!< Acknowledge Error 2 */
#define DSI_ISR0_AE3                   0x00000008U               /*!< Acknowledge Error 3 */
#define DSI_ISR0_AE4                   0x00000010U               /*!< Acknowledge Error 4 */
#define DSI_ISR0_AE5                   0x00000020U               /*!< Acknowledge Error 5 */
#define DSI_ISR0_AE6                   0x00000040U               /*!< Acknowledge Error 6 */
#define DSI_ISR0_AE7                   0x00000080U               /*!< Acknowledge Error 7 */
#define DSI_ISR0_AE8                   0x00000100U               /*!< Acknowledge Error 8 */
#define DSI_ISR0_AE9                   0x00000200U               /*!< Acknowledge Error 9 */
#define DSI_ISR0_AE10                  0x00000400U               /*!< Acknowledge Error 10 */
#define DSI_ISR0_AE11                  0x00000800U               /*!< Acknowledge Error 11 */
#define DSI_ISR0_AE12                  0x00001000U               /*!< Acknowledge Error 12 */
#define DSI_ISR0_AE13                  0x00002000U               /*!< Acknowledge Error 13 */
#define DSI_ISR0_AE14                  0x00004000U               /*!< Acknowledge Error 14 */
#define DSI_ISR0_AE15                  0x00008000U               /*!< Acknowledge Error 15 */
#define DSI_ISR0_PE0                   0x00010000U               /*!< PHY Error 0 */
#define DSI_ISR0_PE1                   0x00020000U               /*!< PHY Error 1 */
#define DSI_ISR0_PE2                   0x00040000U               /*!< PHY Error 2 */
#define DSI_ISR0_PE3                   0x00080000U               /*!< PHY Error 3 */
#define DSI_ISR0_PE4                   0x00100000U               /*!< PHY Error 4 */

/*******************  Bit definition for DSI_ISR1 register  ***************/
#define DSI_ISR1_TOHSTX                0x00000001U               /*!< Timeout High-Speed Transmission */
#define DSI_ISR1_TOLPRX                0x00000002U               /*!< Timeout Low-Power Reception */
#define DSI_ISR1_ECCSE                 0x00000004U               /*!< ECC Single-bit Error */
#define DSI_ISR1_ECCME                 0x00000008U               /*!< ECC Multi-bit Error */
#define DSI_ISR1_CRCE                  0x00000010U               /*!< CRC Error */
#define DSI_ISR1_PSE                   0x00000020U               /*!< Packet Size Error */
#define DSI_ISR1_EOTPE                 0x00000040U               /*!< EoTp Error */
#define DSI_ISR1_LPWRE                 0x00000080U               /*!< LTDC Payload Write Error */
#define DSI_ISR1_GCWRE                 0x00000100U               /*!< Generic Command Write Error */
#define DSI_ISR1_GPWRE                 0x00000200U               /*!< Generic Payload Write Error */
#define DSI_ISR1_GPTXE                 0x00000400U               /*!< Generic Payload Transmit Error */
#define DSI_ISR1_GPRDE                 0x00000800U               /*!< Generic Payload Read Error */
#define DSI_ISR1_GPRXE                 0x00001000U               /*!< Generic Payload Receive Error */

/*******************  Bit definition for DSI_IER0 register  ***************/
#define DSI_IER0_AE0IE                 0x00000001U               /*!< Acknowledge Error 0 Interrupt Enable */
#define DSI_IER0_AE1IE                 0x00000002U               /*!< Acknowledge Error 1 Interrupt Enable */
#define DSI_IER0_AE2IE                 0x00000004U               /*!< Acknowledge Error 2 Interrupt Enable */
#define DSI_IER0_AE3IE                 0x00000008U               /*!< Acknowledge Error 3 Interrupt Enable */
#define DSI_IER0_AE4IE                 0x00000010U               /*!< Acknowledge Error 4 Interrupt Enable */
#define DSI_IER0_AE5IE                 0x00000020U               /*!< Acknowledge Error 5 Interrupt Enable */
#define DSI_IER0_AE6IE                 0x00000040U               /*!< Acknowledge Error 6 Interrupt Enable */
#define DSI_IER0_AE7IE                 0x00000080U               /*!< Acknowledge Error 7 Interrupt Enable */
#define DSI_IER0_AE8IE                 0x00000100U               /*!< Acknowledge Error 8 Interrupt Enable */
#define DSI_IER0_AE9IE                 0x00000200U               /*!< Acknowledge Error 9 Interrupt Enable */
#define DSI_IER0_AE10IE                0x00000400U               /*!< Acknowledge Error 10 Interrupt Enable */
#define DSI_IER0_AE11IE                0x00000800U               /*!< Acknowledge Error 11 Interrupt Enable */
#define DSI_IER0_AE12IE                0x00001000U               /*!< Acknowledge Error 12 Interrupt Enable */
#define DSI_IER0_AE13IE                0x00002000U               /*!< Acknowledge Error 13 Interrupt Enable */
#define DSI_IER0_AE14IE                0x00004000U               /*!< Acknowledge Error 14 Interrupt Enable */
#define DSI_IER0_AE15IE                0x00008000U               /*!< Acknowledge Error 15 Interrupt Enable */
#define DSI_IER0_PE0IE                 0x00010000U               /*!< PHY Error 0 Interrupt Enable */
#define DSI_IER0_PE1IE                 0x00020000U               /*!< PHY Error 1 Interrupt Enable */
#define DSI_IER0_PE2IE                 0x00040000U               /*!< PHY Error 2 Interrupt Enable */
#define DSI_IER0_PE3IE                 0x00080000U               /*!< PHY Error 3 Interrupt Enable */
#define DSI_IER0_PE4IE                 0x00100000U               /*!< PHY Error 4 Interrupt Enable */

