micropython/micropython/stmhal/cmsis/stm32f469xx.h
/*******************  Bit definition for DSI_IER1 register  ***************/
#define DSI_IER1_TOHSTXIE              0x00000001U               /*!< Timeout High-Speed Transmission Interrupt Enable */
#define DSI_IER1_TOLPRXIE              0x00000002U               /*!< Timeout Low-Power Reception Interrupt Enable */
#define DSI_IER1_ECCSEIE               0x00000004U               /*!< ECC Single-bit Error Interrupt Enable */
#define DSI_IER1_ECCMEIE               0x00000008U               /*!< ECC Multi-bit Error Interrupt Enable */
#define DSI_IER1_CRCEIE                0x00000010U               /*!< CRC Error Interrupt Enable */
#define DSI_IER1_PSEIE                 0x00000020U               /*!< Packet Size Error Interrupt Enable */
#define DSI_IER1_EOTPEIE               0x00000040U               /*!< EoTp Error Interrupt Enable */
#define DSI_IER1_LPWREIE               0x00000080U               /*!< LTDC Payload Write Error Interrupt Enable */
#define DSI_IER1_GCWREIE               0x00000100U               /*!< Generic Command Write Error Interrupt Enable */
#define DSI_IER1_GPWREIE               0x00000200U               /*!< Generic Payload Write Error Interrupt Enable */
#define DSI_IER1_GPTXEIE               0x00000400U               /*!< Generic Payload Transmit Error Interrupt Enable */
#define DSI_IER1_GPRDEIE               0x00000800U               /*!< Generic Payload Read Error Interrupt Enable */
#define DSI_IER1_GPRXEIE               0x00001000U               /*!< Generic Payload Receive Error Interrupt Enable */

/*******************  Bit definition for DSI_FIR0 register  ***************/
#define DSI_FIR0_FAE0                  0x00000001U               /*!< Force Acknowledge Error 0 */
#define DSI_FIR0_FAE1                  0x00000002U               /*!< Force Acknowledge Error 1 */
#define DSI_FIR0_FAE2                  0x00000004U               /*!< Force Acknowledge Error 2 */
#define DSI_FIR0_FAE3                  0x00000008U               /*!< Force Acknowledge Error 3 */
#define DSI_FIR0_FAE4                  0x00000010U               /*!< Force Acknowledge Error 4 */
#define DSI_FIR0_FAE5                  0x00000020U               /*!< Force Acknowledge Error 5 */
#define DSI_FIR0_FAE6                  0x00000040U               /*!< Force Acknowledge Error 6 */
#define DSI_FIR0_FAE7                  0x00000080U               /*!< Force Acknowledge Error 7 */
#define DSI_FIR0_FAE8                  0x00000100U               /*!< Force Acknowledge Error 8 */
#define DSI_FIR0_FAE9                  0x00000200U               /*!< Force Acknowledge Error 9 */
#define DSI_FIR0_FAE10                 0x00000400U               /*!< Force Acknowledge Error 10 */
#define DSI_FIR0_FAE11                 0x00000800U               /*!< Force Acknowledge Error 11 */
#define DSI_FIR0_FAE12                 0x00001000U               /*!< Force Acknowledge Error 12 */
#define DSI_FIR0_FAE13                 0x00002000U               /*!< Force Acknowledge Error 13 */
#define DSI_FIR0_FAE14                 0x00004000U               /*!< Force Acknowledge Error 14 */
#define DSI_FIR0_FAE15                 0x00008000U               /*!< Force Acknowledge Error 15 */
#define DSI_FIR0_FPE0                  0x00010000U               /*!< Force PHY Error 0 */
#define DSI_FIR0_FPE1                  0x00020000U               /*!< Force PHY Error 1 */
#define DSI_FIR0_FPE2                  0x00040000U               /*!< Force PHY Error 2 */
#define DSI_FIR0_FPE3                  0x00080000U               /*!< Force PHY Error 3 */
#define DSI_FIR0_FPE4                  0x00100000U               /*!< Force PHY Error 4 */

/*******************  Bit definition for DSI_FIR1 register  ***************/
#define DSI_FIR1_FTOHSTX               0x00000001U               /*!< Force Timeout High-Speed Transmission */
#define DSI_FIR1_FTOLPRX               0x00000002U               /*!< Force Timeout Low-Power Reception */
#define DSI_FIR1_FECCSE                0x00000004U               /*!< Force ECC Single-bit Error */
#define DSI_FIR1_FECCME                0x00000008U               /*!< Force ECC Multi-bit Error */
#define DSI_FIR1_FCRCE                 0x00000010U               /*!< Force CRC Error */
#define DSI_FIR1_FPSE                  0x00000020U               /*!< Force Packet Size Error */
#define DSI_FIR1_FEOTPE                0x00000040U               /*!< Force EoTp Error */
#define DSI_FIR1_FLPWRE                0x00000080U               /*!< Force LTDC Payload Write Error */
#define DSI_FIR1_FGCWRE                0x00000100U               /*!< Force Generic Command Write Error */
#define DSI_FIR1_FGPWRE                0x00000200U               /*!< Force Generic Payload Write Error */
#define DSI_FIR1_FGPTXE                0x00000400U               /*!< Force Generic Payload Transmit Error */
#define DSI_FIR1_FGPRDE                0x00000800U               /*!< Force Generic Payload Read Error */
#define DSI_FIR1_FGPRXE                0x00001000U               /*!< Force Generic Payload Receive Error */

/*******************  Bit definition for DSI_VSCR register  ***************/
#define DSI_VSCR_EN                    0x00000001U               /*!< Enable */
#define DSI_VSCR_UR                    0x00000100U               /*!< Update Register */

/*******************  Bit definition for DSI_LCVCIDR register  ************/
#define DSI_LCVCIDR_VCID               0x00000003U               /*!< Virtual Channel ID */
#define DSI_LCVCIDR_VCID0              0x00000001U
#define DSI_LCVCIDR_VCID1              0x00000002U

/*******************  Bit definition for DSI_LCCCR register  **************/
#define DSI_LCCCR_COLC                 0x0000000FU               /*!< Color Coding */
#define DSI_LCCCR_COLC0                0x00000001U
#define DSI_LCCCR_COLC1                0x00000002U
#define DSI_LCCCR_COLC2                0x00000004U
#define DSI_LCCCR_COLC3                0x00000008U

#define DSI_LCCCR_LPE                  0x00000100U               /*!< Loosely Packed Enable */

