micropython/micropython/stmhal/cmsis/stm32f469xx.h
/*******************  Bit definition for DSI_VLCCR register  **************/
#define DSI_VLCCR_HLINE                0x00007FFFU               /*!< Horizontal Line duration */
#define DSI_VLCCR_HLINE0               0x00000001U
#define DSI_VLCCR_HLINE1               0x00000002U
#define DSI_VLCCR_HLINE2               0x00000004U
#define DSI_VLCCR_HLINE3               0x00000008U
#define DSI_VLCCR_HLINE4               0x00000010U
#define DSI_VLCCR_HLINE5               0x00000020U
#define DSI_VLCCR_HLINE6               0x00000040U
#define DSI_VLCCR_HLINE7               0x00000080U
#define DSI_VLCCR_HLINE8               0x00000100U
#define DSI_VLCCR_HLINE9               0x00000200U
#define DSI_VLCCR_HLINE10              0x00000400U
#define DSI_VLCCR_HLINE11              0x00000800U
#define DSI_VLCCR_HLINE12              0x00001000U
#define DSI_VLCCR_HLINE13              0x00002000U
#define DSI_VLCCR_HLINE14              0x00004000U

/*******************  Bit definition for DSI_VVSACCR register  ***************/
#define DSI_VVSACCR_VSA                   0x000003FFU               /*!< Vertical Synchronism Active duration */
#define DSI_VVSACCR_VSA0                  0x00000001U
#define DSI_VVSACCR_VSA1                  0x00000002U
#define DSI_VVSACCR_VSA2                  0x00000004U
#define DSI_VVSACCR_VSA3                  0x00000008U
#define DSI_VVSACCR_VSA4                  0x00000010U
#define DSI_VVSACCR_VSA5                  0x00000020U
#define DSI_VVSACCR_VSA6                  0x00000040U
#define DSI_VVSACCR_VSA7                  0x00000080U
#define DSI_VVSACCR_VSA8                  0x00000100U
#define DSI_VVSACCR_VSA9                  0x00000200U

/*******************  Bit definition for DSI_VVBPCCR register  ************/
#define DSI_VVBPCCR_VBP                0x000003FFU               /*!< Vertical Back-Porch duration */
#define DSI_VVBPCCR_VBP0               0x00000001U
#define DSI_VVBPCCR_VBP1               0x00000002U
#define DSI_VVBPCCR_VBP2               0x00000004U
#define DSI_VVBPCCR_VBP3               0x00000008U
#define DSI_VVBPCCR_VBP4               0x00000010U
#define DSI_VVBPCCR_VBP5               0x00000020U
#define DSI_VVBPCCR_VBP6               0x00000040U
#define DSI_VVBPCCR_VBP7               0x00000080U
#define DSI_VVBPCCR_VBP8               0x00000100U
#define DSI_VVBPCCR_VBP9               0x00000200U

/*******************  Bit definition for DSI_VVFPCCR register  ************/
#define DSI_VVFPCCR_VFP                0x000003FFU               /*!< Vertical Front-Porch duration */
#define DSI_VVFPCCR_VFP0               0x00000001U
#define DSI_VVFPCCR_VFP1               0x00000002U
#define DSI_VVFPCCR_VFP2               0x00000004U
#define DSI_VVFPCCR_VFP3               0x00000008U
#define DSI_VVFPCCR_VFP4               0x00000010U
#define DSI_VVFPCCR_VFP5               0x00000020U
#define DSI_VVFPCCR_VFP6               0x00000040U
#define DSI_VVFPCCR_VFP7               0x00000080U
#define DSI_VVFPCCR_VFP8               0x00000100U
#define DSI_VVFPCCR_VFP9               0x00000200U

/*******************  Bit definition for DSI_VVACCR register  *************/
#define DSI_VVACCR_VA                  0x00003FFFU               /*!< Vertical Active duration */
#define DSI_VVACCR_VA0                 0x00000001U
#define DSI_VVACCR_VA1                 0x00000002U
#define DSI_VVACCR_VA2                 0x00000004U
#define DSI_VVACCR_VA3                 0x00000008U
#define DSI_VVACCR_VA4                 0x00000010U
#define DSI_VVACCR_VA5                 0x00000020U
#define DSI_VVACCR_VA6                 0x00000040U
#define DSI_VVACCR_VA7                 0x00000080U
#define DSI_VVACCR_VA8                 0x00000100U
#define DSI_VVACCR_VA9                 0x00000200U
#define DSI_VVACCR_VA10                0x00000400U
#define DSI_VVACCR_VA11                0x00000800U
#define DSI_VVACCR_VA12                0x00001000U
#define DSI_VVACCR_VA13                0x00002000U

/*******************  Bit definition for DSI_TDCCR register  **************/
#define DSI_TDCCR_3DM                  0x00000003U               /*!< 3D Mode */
#define DSI_TDCCR_3DM0                 0x00000001U
#define DSI_TDCCR_3DM1                 0x00000002U

#define DSI_TDCCR_3DF                  0x0000000CU               /*!< 3D Format */
#define DSI_TDCCR_3DF0                 0x00000004U
#define DSI_TDCCR_3DF1                 0x00000008U

#define DSI_TDCCR_SVS                  0x00000010U               /*!< Second VSYNC */
#define DSI_TDCCR_RF                   0x00000020U               /*!< Right First */
#define DSI_TDCCR_S3DC                 0x00010000U               /*!< Send 3D Control */

/*******************  Bit definition for DSI_WCFGR register  ***************/
#define DSI_WCFGR_DSIM                   0x00000001U              /*!< DSI Mode */
#define DSI_WCFGR_COLMUX                 0x0000000EU              /*!< Color Multiplexing */
#define DSI_WCFGR_COLMUX0                0x00000002U
#define DSI_WCFGR_COLMUX1                0x00000004U
#define DSI_WCFGR_COLMUX2                0x00000008U

#define DSI_WCFGR_TESRC                  0x00000010U              /*!< Tearing Effect Source */
#define DSI_WCFGR_TEPOL                  0x00000020U              /*!< Tearing Effect Polarity */
#define DSI_WCFGR_AR                     0x00000040U              /*!< Automatic Refresh */
#define DSI_WCFGR_VSPOL                  0x00000080U              /*!< VSync Polarity */

/*******************  Bit definition for DSI_WCR register  *****************/
#define DSI_WCR_COLM                     0x00000001U              /*!< Color Mode */
#define DSI_WCR_SHTDN                    0x00000002U              /*!< Shutdown */
#define DSI_WCR_LTDCEN                   0x00000004U              /*!< LTDC Enable */
#define DSI_WCR_DSIEN                    0x00000008U              /*!< DSI Enable */

/*******************  Bit definition for DSI_WIER register  ****************/
#define DSI_WIER_TEIE                    0x00000001U              /*!< Tearing Effect Interrupt Enable */
#define DSI_WIER_ERIE                    0x00000002U              /*!< End of Refresh Interrupt Enable */
#define DSI_WIER_PLLLIE                  0x00000200U              /*!< PLL Lock Interrupt Enable */
#define DSI_WIER_PLLUIE                  0x00000400U              /*!< PLL Unlock Interrupt Enable */
#define DSI_WIER_RRIE                    0x00002000U              /*!< Regulator Ready Interrupt Enable */

/*******************  Bit definition for DSI_WISR register  ****************/
#define DSI_WISR_TEIF                    0x00000001U              /*!< Tearing Effect Interrupt Flag */
#define DSI_WISR_ERIF                    0x00000002U              /*!< End of Refresh Interrupt Flag */
#define DSI_WISR_BUSY                    0x00000004U              /*!< Busy Flag */
#define DSI_WISR_PLLLS                   0x00000100U              /*!< PLL Lock Status */
#define DSI_WISR_PLLLIF                  0x00000200U              /*!< PLL Lock Interrupt Flag */
#define DSI_WISR_PLLUIF                  0x00000400U              /*!< PLL Unlock Interrupt Flag */
#define DSI_WISR_RRS                     0x00001000U              /*!< Regulator Ready Flag */
#define DSI_WISR_RRIF                    0x00002000U              /*!< Regulator Ready Interrupt Flag */

/*******************  Bit definition for DSI_WIFCR register  ***************/
#define DSI_WIFCR_CTEIF                  0x00000001U              /*!< Clear Tearing Effect Interrupt Flag */
#define DSI_WIFCR_CERIF                  0x00000002U              /*!< Clear End of Refresh Interrupt Flag */
#define DSI_WIFCR_CPLLLIF                0x00000200U              /*!< Clear PLL Lock Interrupt Flag */
#define DSI_WIFCR_CPLLUIF                0x00000400U              /*!< Clear PLL Unlock Interrupt Flag */
#define DSI_WIFCR_CRRIF                  0x00002000U              /*!< Clear Regulator Ready Interrupt Flag */

