micropython/micropython/stmhal/cmsis/stm32f469xx.h
#define  FMC_BWTR3_DATAST                   0x0000FF00U        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR3_DATAST_0                 0x00000100U        /*!<Bit 0 */
#define  FMC_BWTR3_DATAST_1                 0x00000200U        /*!<Bit 1 */
#define  FMC_BWTR3_DATAST_2                 0x00000400U        /*!<Bit 2 */
#define  FMC_BWTR3_DATAST_3                 0x00000800U        /*!<Bit 3 */
#define  FMC_BWTR3_DATAST_4                 0x00001000U        /*!<Bit 4 */
#define  FMC_BWTR3_DATAST_5                 0x00002000U        /*!<Bit 5 */
#define  FMC_BWTR3_DATAST_6                 0x00004000U        /*!<Bit 6 */
#define  FMC_BWTR3_DATAST_7                 0x00008000U        /*!<Bit 7 */

#define  FMC_BWTR3_BUSTURN                  0x000F0000U        /*!<BUSTURN[3:0] bits (Bus turnaround duration) */
#define  FMC_BWTR3_BUSTURN_0                0x00010000U        /*!<Bit 0 */
#define  FMC_BWTR3_BUSTURN_1                0x00020000U        /*!<Bit 1 */
#define  FMC_BWTR3_BUSTURN_2                0x00040000U        /*!<Bit 2 */
#define  FMC_BWTR3_BUSTURN_3                0x00080000U        /*!<Bit 3 */

#define  FMC_BWTR3_ACCMOD                   0x30000000U        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR3_ACCMOD_0                 0x10000000U        /*!<Bit 0 */
#define  FMC_BWTR3_ACCMOD_1                 0x20000000U        /*!<Bit 1 */

/******************  Bit definition for FMC_BWTR4 register  ******************/
#define  FMC_BWTR4_ADDSET                   0x0000000FU        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR4_ADDSET_0                 0x00000001U        /*!<Bit 0 */
#define  FMC_BWTR4_ADDSET_1                 0x00000002U        /*!<Bit 1 */
#define  FMC_BWTR4_ADDSET_2                 0x00000004U        /*!<Bit 2 */
#define  FMC_BWTR4_ADDSET_3                 0x00000008U        /*!<Bit 3 */

#define  FMC_BWTR4_ADDHLD                   0x000000F0U        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR4_ADDHLD_0                 0x00000010U        /*!<Bit 0 */
#define  FMC_BWTR4_ADDHLD_1                 0x00000020U        /*!<Bit 1 */
#define  FMC_BWTR4_ADDHLD_2                 0x00000040U        /*!<Bit 2 */
#define  FMC_BWTR4_ADDHLD_3                 0x00000080U        /*!<Bit 3 */

#define  FMC_BWTR4_DATAST                   0x0000FF00U        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR4_DATAST_0                 0x00000100U        /*!<Bit 0 */
#define  FMC_BWTR4_DATAST_1                 0x00000200U        /*!<Bit 1 */
#define  FMC_BWTR4_DATAST_2                 0x00000400U        /*!<Bit 2 */
#define  FMC_BWTR4_DATAST_3                 0x00000800U        /*!<Bit 3 */
#define  FMC_BWTR4_DATAST_4                 0x00001000U        /*!<Bit 4 */
#define  FMC_BWTR4_DATAST_5                 0x00002000U        /*!<Bit 5 */
#define  FMC_BWTR4_DATAST_6                 0x00004000U        /*!<Bit 6 */
#define  FMC_BWTR4_DATAST_7                 0x00008000U        /*!<Bit 7 */

#define  FMC_BWTR4_BUSTURN                  0x000F0000U        /*!<BUSTURN[3:0] bits (Bus turnaround duration) */
#define  FMC_BWTR4_BUSTURN_0                0x00010000U        /*!<Bit 0 */
#define  FMC_BWTR4_BUSTURN_1                0x00020000U        /*!<Bit 1 */
#define  FMC_BWTR4_BUSTURN_2                0x00040000U        /*!<Bit 2 */
#define  FMC_BWTR4_BUSTURN_3                0x00080000U        /*!<Bit 3 */

#define  FMC_BWTR4_ACCMOD                   0x30000000U        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR4_ACCMOD_0                 0x10000000U        /*!<Bit 0 */
#define  FMC_BWTR4_ACCMOD_1                 0x20000000U        /*!<Bit 1 */

/******************  Bit definition for FMC_PCR register  *******************/
#define  FMC_PCR_PWAITEN                   0x00000002U        /*!<Wait feature enable bit                   */
#define  FMC_PCR_PBKEN                     0x00000004U        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR_PTYP                      0x00000008U        /*!<Memory type                               */

#define  FMC_PCR_PWID                      0x00000030U        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR_PWID_0                    0x00000010U        /*!<Bit 0 */
#define  FMC_PCR_PWID_1                    0x00000020U        /*!<Bit 1 */

#define  FMC_PCR_ECCEN                     0x00000040U        /*!<ECC computation logic enable bit          */

#define  FMC_PCR_TCLR                      0x00001E00U        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR_TCLR_0                    0x00000200U        /*!<Bit 0 */
#define  FMC_PCR_TCLR_1                    0x00000400U        /*!<Bit 1 */
#define  FMC_PCR_TCLR_2                    0x00000800U        /*!<Bit 2 */
#define  FMC_PCR_TCLR_3                    0x00001000U        /*!<Bit 3 */

#define  FMC_PCR_TAR                       0x0001E000U        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR_TAR_0                     0x00002000U        /*!<Bit 0 */
#define  FMC_PCR_TAR_1                     0x00004000U        /*!<Bit 1 */
#define  FMC_PCR_TAR_2                     0x00008000U        /*!<Bit 2 */
#define  FMC_PCR_TAR_3                     0x00010000U        /*!<Bit 3 */

#define  FMC_PCR_ECCPS                     0x000E0000U        /*!<ECCPS[1:0] bits (ECC page size)           */
#define  FMC_PCR_ECCPS_0                   0x00020000U        /*!<Bit 0 */
#define  FMC_PCR_ECCPS_1                   0x00040000U        /*!<Bit 1 */
#define  FMC_PCR_ECCPS_2                   0x00080000U        /*!<Bit 2 */

/*******************  Bit definition for FMC_SR register  *******************/
#define  FMC_SR_IRS                        0x01U               /*!<Interrupt Rising Edge status                */
#define  FMC_SR_ILS                        0x02U               /*!<Interrupt Level status                      */
#define  FMC_SR_IFS                        0x04U               /*!<Interrupt Falling Edge status               */
#define  FMC_SR_IREN                       0x08U               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR_ILEN                       0x10U               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR_IFEN                       0x20U               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR_FEMPT                      0x40U               /*!<FIFO empty                                  */

/******************  Bit definition for FMC_PMEM register  ******************/
#define  FMC_PMEM_MEMSET2                  0x000000FFU        /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define  FMC_PMEM_MEMSET2_0                0x00000001U        /*!<Bit 0 */
#define  FMC_PMEM_MEMSET2_1                0x00000002U        /*!<Bit 1 */
#define  FMC_PMEM_MEMSET2_2                0x00000004U        /*!<Bit 2 */
#define  FMC_PMEM_MEMSET2_3                0x00000008U        /*!<Bit 3 */
#define  FMC_PMEM_MEMSET2_4                0x00000010U        /*!<Bit 4 */
#define  FMC_PMEM_MEMSET2_5                0x00000020U        /*!<Bit 5 */
#define  FMC_PMEM_MEMSET2_6                0x00000040U        /*!<Bit 6 */
#define  FMC_PMEM_MEMSET2_7                0x00000080U        /*!<Bit 7 */

#define  FMC_PMEM_MEMWAIT2                 0x0000FF00U        /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define  FMC_PMEM_MEMWAIT2_0               0x00000100U        /*!<Bit 0 */
#define  FMC_PMEM_MEMWAIT2_1               0x00000200U        /*!<Bit 1 */
#define  FMC_PMEM_MEMWAIT2_2               0x00000400U        /*!<Bit 2 */
#define  FMC_PMEM_MEMWAIT2_3               0x00000800U        /*!<Bit 3 */
#define  FMC_PMEM_MEMWAIT2_4               0x00001000U        /*!<Bit 4 */
#define  FMC_PMEM_MEMWAIT2_5               0x00002000U        /*!<Bit 5 */
#define  FMC_PMEM_MEMWAIT2_6               0x00004000U        /*!<Bit 6 */
#define  FMC_PMEM_MEMWAIT2_7               0x00008000U        /*!<Bit 7 */

#define  FMC_PMEM_MEMHOLD2                 0x00FF0000U        /*!<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define  FMC_PMEM_MEMHOLD2_0               0x00010000U        /*!<Bit 0 */
#define  FMC_PMEM_MEMHOLD2_1               0x00020000U        /*!<Bit 1 */
#define  FMC_PMEM_MEMHOLD2_2               0x00040000U        /*!<Bit 2 */
#define  FMC_PMEM_MEMHOLD2_3               0x00080000U        /*!<Bit 3 */
#define  FMC_PMEM_MEMHOLD2_4               0x00100000U        /*!<Bit 4 */
#define  FMC_PMEM_MEMHOLD2_5               0x00200000U        /*!<Bit 5 */
#define  FMC_PMEM_MEMHOLD2_6               0x00400000U        /*!<Bit 6 */
#define  FMC_PMEM_MEMHOLD2_7               0x00800000U        /*!<Bit 7 */

#define  FMC_PMEM_MEMHIZ2                  0xFF000000U        /*!<MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
#define  FMC_PMEM_MEMHIZ2_0                0x01000000U        /*!<Bit 0 */
#define  FMC_PMEM_MEMHIZ2_1                0x02000000U        /*!<Bit 1 */
#define  FMC_PMEM_MEMHIZ2_2                0x04000000U        /*!<Bit 2 */
#define  FMC_PMEM_MEMHIZ2_3                0x08000000U        /*!<Bit 3 */
#define  FMC_PMEM_MEMHIZ2_4                0x10000000U        /*!<Bit 4 */
#define  FMC_PMEM_MEMHIZ2_5                0x20000000U        /*!<Bit 5 */
#define  FMC_PMEM_MEMHIZ2_6                0x40000000U        /*!<Bit 6 */
#define  FMC_PMEM_MEMHIZ2_7                0x80000000U        /*!<Bit 7 */

