micropython/micropython/stmhal/cmsis/stm32f469xx.h
/******************  Bit definition for FMC_PATT register  ******************/
#define  FMC_PATT_ATTSET2                  0x000000FFU        /*!<ATTSET2[7:0] bits (Attribute memory 2 setup time) */
#define  FMC_PATT_ATTSET2_0                0x00000001U        /*!<Bit 0 */
#define  FMC_PATT_ATTSET2_1                0x00000002U        /*!<Bit 1 */
#define  FMC_PATT_ATTSET2_2                0x00000004U        /*!<Bit 2 */
#define  FMC_PATT_ATTSET2_3                0x00000008U        /*!<Bit 3 */
#define  FMC_PATT_ATTSET2_4                0x00000010U        /*!<Bit 4 */
#define  FMC_PATT_ATTSET2_5                0x00000020U        /*!<Bit 5 */
#define  FMC_PATT_ATTSET2_6                0x00000040U        /*!<Bit 6 */
#define  FMC_PATT_ATTSET2_7                0x00000080U        /*!<Bit 7 */

#define  FMC_PATT_ATTWAIT2                 0x0000FF00U        /*!<ATTWAIT2[7:0] bits (Attribute memory 2 wait time) */
#define  FMC_PATT_ATTWAIT2_0               0x00000100U        /*!<Bit 0 */
#define  FMC_PATT_ATTWAIT2_1               0x00000200U        /*!<Bit 1 */
#define  FMC_PATT_ATTWAIT2_2               0x00000400U        /*!<Bit 2 */
#define  FMC_PATT_ATTWAIT2_3               0x00000800U        /*!<Bit 3 */
#define  FMC_PATT_ATTWAIT2_4               0x00001000U        /*!<Bit 4 */
#define  FMC_PATT_ATTWAIT2_5               0x00002000U        /*!<Bit 5 */
#define  FMC_PATT_ATTWAIT2_6               0x00004000U        /*!<Bit 6 */
#define  FMC_PATT_ATTWAIT2_7               0x00008000U        /*!<Bit 7 */

#define  FMC_PATT_ATTHOLD2                 0x00FF0000U        /*!<ATTHOLD2[7:0] bits (Attribute memory 2 hold time) */
#define  FMC_PATT_ATTHOLD2_0               0x00010000U        /*!<Bit 0 */
#define  FMC_PATT_ATTHOLD2_1               0x00020000U        /*!<Bit 1 */
#define  FMC_PATT_ATTHOLD2_2               0x00040000U        /*!<Bit 2 */
#define  FMC_PATT_ATTHOLD2_3               0x00080000U        /*!<Bit 3 */
#define  FMC_PATT_ATTHOLD2_4               0x00100000U        /*!<Bit 4 */
#define  FMC_PATT_ATTHOLD2_5               0x00200000U        /*!<Bit 5 */
#define  FMC_PATT_ATTHOLD2_6               0x00400000U        /*!<Bit 6 */
#define  FMC_PATT_ATTHOLD2_7               0x00800000U        /*!<Bit 7 */

#define  FMC_PATT_ATTHIZ2                  0xFF000000U        /*!<ATTHIZ2[7:0] bits (Attribute memory 2 databus HiZ time) */
#define  FMC_PATT_ATTHIZ2_0                0x01000000U        /*!<Bit 0 */
#define  FMC_PATT_ATTHIZ2_1                0x02000000U        /*!<Bit 1 */
#define  FMC_PATT_ATTHIZ2_2                0x04000000U        /*!<Bit 2 */
#define  FMC_PATT_ATTHIZ2_3                0x08000000U        /*!<Bit 3 */
#define  FMC_PATT_ATTHIZ2_4                0x10000000U        /*!<Bit 4 */
#define  FMC_PATT_ATTHIZ2_5                0x20000000U        /*!<Bit 5 */
#define  FMC_PATT_ATTHIZ2_6                0x40000000U        /*!<Bit 6 */
#define  FMC_PATT_ATTHIZ2_7                0x80000000U        /*!<Bit 7 */

/******************  Bit definition for FMC_ECCR register  ******************/
#define  FMC_ECCR_ECC2                     0xFFFFFFFFU        /*!<ECC result */

/******************  Bit definition for FMC_SDCR1 register  ******************/
#define  FMC_SDCR1_NC                       0x00000003U        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR1_NC_0                     0x00000001U        /*!<Bit 0 */
#define  FMC_SDCR1_NC_1                     0x00000002U        /*!<Bit 1 */

#define  FMC_SDCR1_NR                       0x0000000CU        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_NR_0                     0x00000004U        /*!<Bit 0 */
#define  FMC_SDCR1_NR_1                     0x00000008U        /*!<Bit 1 */

#define  FMC_SDCR1_MWID                     0x00000030U        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_MWID_0                   0x00000010U        /*!<Bit 0 */
#define  FMC_SDCR1_MWID_1                   0x00000020U        /*!<Bit 1 */

#define  FMC_SDCR1_NB                       0x00000040U        /*!<Number of internal bank */

#define  FMC_SDCR1_CAS                      0x00000180U        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR1_CAS_0                    0x00000080U        /*!<Bit 0 */
#define  FMC_SDCR1_CAS_1                    0x00000100U        /*!<Bit 1 */

#define  FMC_SDCR1_WP                       0x00000200U        /*!<Write protection */

#define  FMC_SDCR1_SDCLK                    0x00000C00U        /*!<SDRAM clock configuration */
#define  FMC_SDCR1_SDCLK_0                  0x00000400U        /*!<Bit 0 */
#define  FMC_SDCR1_SDCLK_1                  0x00000800U        /*!<Bit 1 */

#define  FMC_SDCR1_RBURST                   0x00001000U        /*!<Read burst */

#define  FMC_SDCR1_RPIPE                    0x00006000U        /*!<Write protection */
#define  FMC_SDCR1_RPIPE_0                  0x00002000U        /*!<Bit 0 */
#define  FMC_SDCR1_RPIPE_1                  0x00004000U        /*!<Bit 1 */

/******************  Bit definition for FMC_SDCR2 register  ******************/
#define  FMC_SDCR2_NC                       0x00000003U        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR2_NC_0                     0x00000001U        /*!<Bit 0 */
#define  FMC_SDCR2_NC_1                     0x00000002U        /*!<Bit 1 */

#define  FMC_SDCR2_NR                       0x0000000CU        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_NR_0                     0x00000004U        /*!<Bit 0 */
#define  FMC_SDCR2_NR_1                     0x00000008U        /*!<Bit 1 */

#define  FMC_SDCR2_MWID                     0x00000030U        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_MWID_0                   0x00000010U        /*!<Bit 0 */
#define  FMC_SDCR2_MWID_1                   0x00000020U        /*!<Bit 1 */

#define  FMC_SDCR2_NB                       0x00000040U        /*!<Number of internal bank */

#define  FMC_SDCR2_CAS                      0x00000180U        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR2_CAS_0                    0x00000080U        /*!<Bit 0 */
#define  FMC_SDCR2_CAS_1                    0x00000100U        /*!<Bit 1 */

#define  FMC_SDCR2_WP                       0x00000200U        /*!<Write protection */

#define  FMC_SDCR2_SDCLK                    0x00000C00U        /*!<SDCLK[1:0] (SDRAM clock configuration) */
#define  FMC_SDCR2_SDCLK_0                  0x00000400U        /*!<Bit 0 */
#define  FMC_SDCR2_SDCLK_1                  0x00000800U        /*!<Bit 1 */

#define  FMC_SDCR2_RBURST                   0x00001000U        /*!<Read burst */

#define  FMC_SDCR2_RPIPE                    0x00006000U        /*!<RPIPE[1:0](Read pipe) */
#define  FMC_SDCR2_RPIPE_0                  0x00002000U        /*!<Bit 0 */
#define  FMC_SDCR2_RPIPE_1                  0x00004000U        /*!<Bit 1 */

/******************  Bit definition for FMC_SDTR1 register  ******************/
#define  FMC_SDTR1_TMRD                     0x0000000FU        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR1_TMRD_0                   0x00000001U        /*!<Bit 0 */
#define  FMC_SDTR1_TMRD_1                   0x00000002U        /*!<Bit 1 */
#define  FMC_SDTR1_TMRD_2                   0x00000004U        /*!<Bit 2 */
#define  FMC_SDTR1_TMRD_3                   0x00000008U        /*!<Bit 3 */
                                            
