micropython/micropython/stmhal/cmsis/stm32f469xx.h
#define  SAI_xCR1_MCKDIV                  0x00F00000U        /*!<MCKDIV[3:0] (Master ClocK Divider)  */
#define  SAI_xCR1_MCKDIV_0                0x00100000U        /*!<Bit 0  */
#define  SAI_xCR1_MCKDIV_1                0x00200000U        /*!<Bit 1  */
#define  SAI_xCR1_MCKDIV_2                0x00400000U        /*!<Bit 2  */
#define  SAI_xCR1_MCKDIV_3                0x00800000U        /*!<Bit 3  */

/*******************  Bit definition for SAI_xCR2 register  *******************/
#define  SAI_xCR2_FTH                     0x00000007U        /*!<FTH[2:0](Fifo THreshold)  */
#define  SAI_xCR2_FTH_0                   0x00000001U        /*!<Bit 0 */
#define  SAI_xCR2_FTH_1                   0x00000002U        /*!<Bit 1 */
#define  SAI_xCR2_FTH_2                   0x00000004U        /*!<Bit 2 */

#define  SAI_xCR2_FFLUSH                  0x00000008U        /*!<Fifo FLUSH                       */
#define  SAI_xCR2_TRIS                    0x00000010U        /*!<TRIState Management on data line */
#define  SAI_xCR2_MUTE                    0x00000020U        /*!<Mute mode                        */
#define  SAI_xCR2_MUTEVAL                 0x00000040U        /*!<Muate value                      */

#define  SAI_xCR2_MUTECNT                  0x00001F80U       /*!<MUTECNT[5:0] (MUTE counter) */
#define  SAI_xCR2_MUTECNT_0               0x00000080U        /*!<Bit 0 */
#define  SAI_xCR2_MUTECNT_1               0x00000100U        /*!<Bit 1 */
#define  SAI_xCR2_MUTECNT_2               0x00000200U        /*!<Bit 2 */
#define  SAI_xCR2_MUTECNT_3               0x00000400U        /*!<Bit 3 */
#define  SAI_xCR2_MUTECNT_4               0x00000800U        /*!<Bit 4 */
#define  SAI_xCR2_MUTECNT_5               0x00001000U        /*!<Bit 5 */

#define  SAI_xCR2_CPL                     0x00002000U        /*!< Complement Bit             */

#define  SAI_xCR2_COMP                    0x0000C000U        /*!<COMP[1:0] (Companding mode) */
#define  SAI_xCR2_COMP_0                  0x00004000U        /*!<Bit 0 */
#define  SAI_xCR2_COMP_1                  0x00008000U        /*!<Bit 1 */

/******************  Bit definition for SAI_xFRCR register  *******************/
#define  SAI_xFRCR_FRL                    0x000000FFU        /*!<FRL[1:0](Frame length)  */
#define  SAI_xFRCR_FRL_0                  0x00000001U        /*!<Bit 0 */
#define  SAI_xFRCR_FRL_1                  0x00000002U        /*!<Bit 1 */
#define  SAI_xFRCR_FRL_2                  0x00000004U        /*!<Bit 2 */
#define  SAI_xFRCR_FRL_3                  0x00000008U        /*!<Bit 3 */
#define  SAI_xFRCR_FRL_4                  0x00000010U        /*!<Bit 4 */
#define  SAI_xFRCR_FRL_5                  0x00000020U        /*!<Bit 5 */
#define  SAI_xFRCR_FRL_6                  0x00000040U        /*!<Bit 6 */
#define  SAI_xFRCR_FRL_7                  0x00000080U        /*!<Bit 7 */

#define  SAI_xFRCR_FSALL                  0x00007F00U        /*!<FRL[1:0] (Frame synchronization active level length)  */
#define  SAI_xFRCR_FSALL_0                0x00000100U        /*!<Bit 0 */
#define  SAI_xFRCR_FSALL_1                0x00000200U        /*!<Bit 1 */
#define  SAI_xFRCR_FSALL_2                0x00000400U        /*!<Bit 2 */
#define  SAI_xFRCR_FSALL_3                0x00000800U        /*!<Bit 3 */
#define  SAI_xFRCR_FSALL_4                0x00001000U        /*!<Bit 4 */
#define  SAI_xFRCR_FSALL_5                0x00002000U        /*!<Bit 5 */
#define  SAI_xFRCR_FSALL_6                0x00004000U        /*!<Bit 6 */

#define  SAI_xFRCR_FSDEF                  0x00010000U        /*!< Frame Synchronization Definition */
#define  SAI_xFRCR_FSPOL                  0x00020000U        /*!<Frame Synchronization POLarity    */
#define  SAI_xFRCR_FSOFF                  0x00040000U        /*!<Frame Synchronization OFFset      */
/* Legacy defines */
#define  SAI_xFRCR_FSPO                   SAI_xFRCR_FSPOL

/******************  Bit definition for SAI_xSLOTR register  *******************/
#define  SAI_xSLOTR_FBOFF                 0x0000001FU        /*!<FRL[4:0](First Bit Offset)  */
#define  SAI_xSLOTR_FBOFF_0               0x00000001U        /*!<Bit 0 */
#define  SAI_xSLOTR_FBOFF_1               0x00000002U        /*!<Bit 1 */
#define  SAI_xSLOTR_FBOFF_2               0x00000004U        /*!<Bit 2 */
#define  SAI_xSLOTR_FBOFF_3               0x00000008U        /*!<Bit 3 */
#define  SAI_xSLOTR_FBOFF_4               0x00000010U        /*!<Bit 4 */

#define  SAI_xSLOTR_SLOTSZ                0x000000C0U        /*!<SLOTSZ[1:0] (Slot size)  */
#define  SAI_xSLOTR_SLOTSZ_0              0x00000040U        /*!<Bit 0 */
#define  SAI_xSLOTR_SLOTSZ_1              0x00000080U        /*!<Bit 1 */

#define  SAI_xSLOTR_NBSLOT                0x00000F00U        /*!<NBSLOT[3:0] (Number of Slot in audio Frame)  */
#define  SAI_xSLOTR_NBSLOT_0              0x00000100U        /*!<Bit 0 */
#define  SAI_xSLOTR_NBSLOT_1              0x00000200U        /*!<Bit 1 */
#define  SAI_xSLOTR_NBSLOT_2              0x00000400U        /*!<Bit 2 */
#define  SAI_xSLOTR_NBSLOT_3              0x00000800U        /*!<Bit 3 */

#define  SAI_xSLOTR_SLOTEN                0xFFFF0000U        /*!<SLOTEN[15:0] (Slot Enable)  */

/*******************  Bit definition for SAI_xIMR register  *******************/
#define  SAI_xIMR_OVRUDRIE                0x00000001U        /*!<Overrun underrun interrupt enable                              */
#define  SAI_xIMR_MUTEDETIE               0x00000002U        /*!<Mute detection interrupt enable                                */
#define  SAI_xIMR_WCKCFGIE                0x00000004U        /*!<Wrong Clock Configuration interrupt enable                     */
#define  SAI_xIMR_FREQIE                  0x00000008U        /*!<FIFO request interrupt enable                                  */
#define  SAI_xIMR_CNRDYIE                 0x00000010U        /*!<Codec not ready interrupt enable                               */
#define  SAI_xIMR_AFSDETIE                0x00000020U        /*!<Anticipated frame synchronization detection interrupt enable   */
#define  SAI_xIMR_LFSDETIE                0x00000040U        /*!<Late frame synchronization detection interrupt enable          */

/********************  Bit definition for SAI_xSR register  *******************/
#define  SAI_xSR_OVRUDR                   0x00000001U         /*!<Overrun underrun                               */
#define  SAI_xSR_MUTEDET                  0x00000002U         /*!<Mute detection                                 */
#define  SAI_xSR_WCKCFG                   0x00000004U         /*!<Wrong Clock Configuration                      */
#define  SAI_xSR_FREQ                     0x00000008U         /*!<FIFO request                                   */
#define  SAI_xSR_CNRDY                    0x00000010U         /*!<Codec not ready                                */
#define  SAI_xSR_AFSDET                   0x00000020U         /*!<Anticipated frame synchronization detection    */
#define  SAI_xSR_LFSDET                   0x00000040U         /*!<Late frame synchronization detection           */

#define  SAI_xSR_FLVL                     0x00070000U         /*!<FLVL[2:0] (FIFO Level Threshold)               */
#define  SAI_xSR_FLVL_0                   0x00010000U         /*!<Bit 0 */
#define  SAI_xSR_FLVL_1                   0x00020000U         /*!<Bit 1 */
#define  SAI_xSR_FLVL_2                   0x00040000U         /*!<Bit 2 */

